[Killed] ConditionalExpression
src/components/Digimon.js:6:7
 import '../styles/digimon.css';
 
 function Digimon({ digimon, error }) {
-  if (error) {
+  if (false) {
     return (<section>{error}</section>);
   }
killedBy: Realize os testes da busca por Digimon A mensagem de erro é renderizada caso o Digimon buscado não exista
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
src/components/Digimon.js:6:7
 import '../styles/digimon.css';
 
 function Digimon({ digimon, error }) {
-  if (error) {
+  if (true) {
     return (<section>{error}</section>);
   }
killedBy: Realize os testes da busca por Digimon É possível buscar um Digimon com sucesso
statusReason: Error: Unable to find an element with the text: /greymon/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header>
      <nav>
        <img
