[Killed] BooleanLiteral
src/pages/Search.js:10:50
 class Home extends React.Component {
   constructor() {
     super();
-    this.state = { searchDigimon: '', isFetched: false, errorMessage: '' };
+    this.state = { searchDigimon: '', isFetched: true, errorMessage: '' };
 
     this.inputValue = this.inputValue.bind(this);
killedBy: Realize os testes da busca por Digimon É possível inserir um valor na caixa de busca
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] BooleanLiteral
src/pages/Search.js:30:22
         this.setState({
           digimon: digimons[0],
           errorMessage: digimons.ErrorMsg,
-          isFetched: true,
+          isFetched: false,
         });
       } catch (error) {
killedBy: Realize os testes da busca por Digimon É possível buscar um Digimon com sucesso
statusReason: Error: Unable to find an element with the text: /greymon/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header>
      <nav>
        <img

[Killed] ConditionalExpression
src/pages/Search.js:60:12
           >
             Search Digimon
           </button>
-          {isFetched && <Digimon digimon={ digimon } error={ errorMessage } /> }
+          {true }
         </main>
       </>
killedBy: Realize os testes da busca por Digimon É possível buscar um Digimon com sucesso
statusReason: Error: Unable to find an element with the text: /greymon/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header>
      <nav>
        <img

[Killed] LogicalOperator
src/pages/Search.js:60:12
           >
             Search Digimon
           </button>
-          {isFetched && <Digimon digimon={ digimon } error={ errorMessage } /> }
+          {isFetched || <Digimon digimon={digimon} error={errorMessage} /> }
         </main>
       </>
killedBy: Realize os testes da busca por Digimon É possível inserir um valor na caixa de busca
statusReason: TypeError: Cannot read properties of null (reading 'name')
